/* No comment provided by engineer. */
"%1$@ on %2$@" = "%1$@ ar %2$@";

/* 'AUTHOR on POST TITLE: COMMENT' in a comment list */
"%1$@ on %2$@: %3$@" = "%1$@ ar %2$@: %3$@";

/* The number of followers of a site. The '%@' is a placeholder for the numeric value. Example: `1000 followers` */
"%@ followers" = "%@ dilynwr";

/* Insights Percent of views label with value */
"%@ of views" = "%@ golwg";

/* Views graph label */
"%@ views" = "%@ golwg";

/* Views per Visitor graph label */
"%@ views per visitor" = "%@ golwg fesul ymwelydd";

/* Visitors graph label */
"%@ visitors" = "%@ ymwelydd";

/* Age between dates over one day. */
"%d days" = "%d diwrnod";

/* Age between dates over one hour. */
"%d hours" = "%d awr";

/* Age between dates over one month. */
"%d months" = "%d mis";

/* Age between dates over one year. */
"%d years" = "%d blwyddyn";

/* Days duration single character abbreviation */
"%id" = "%id";

/* Hours duration single character abbreviation */
"%ih" = "%ih";

/* Minutes duration single character abbreviation */
"%im" = "%im";

/* Empty Post Title */
"(No Title)" = "(Dim Teitl)";

/* No comment provided by engineer. */
"(no title)" = "(dim teitl)";

/* A short label that tells the user the estimated reading time of an article. '%d' is a placeholder for the number of minutes. '~' denotes an estimation. */
"(~ %d min)" = "(~ %d mun)";

/* Age between dates less than one hour. */
"<1 hour" = "< 1 awr";

/* No comment provided by engineer. */
"A Media file is currently uploading. Please try later." = "Mae ffeil cyfrwng yn llwytho. Rhowch gynnig arall yn ddiweddarach.";

/* No comment provided by engineer. */
"A simple preview is shown below." = "Mae rhagolwg syml isod.";

/* Error message displayed when the user is Signing into a self hosted site and tapped the 1Password Button before typing his siteURL */
"A site address is required before 1Password can be used." = "Mae angen cyfeiriad gwefan cyn bod modd defnyddio 1Password.";

/* Placeholder text for the title of a site */
"A title for the site" = "Teitl y wefan";

/* No comment provided by engineer. */
"ADD NEW WORDPRESS" = "YCHWANEGU WORDPRESS NEWYDD";

/* About this app (information page title) */
"About" = "Ynghylch";

/* Accept Button Title */
"Accept" = "Derbyn";

/* Title for the account section in site settings screen */
"Account" = "Cyfrif";

/* No comment provided by engineer. */
"Account Settings" = "Gosodiadau'r Cyfrif";

/* No comment provided by engineer. */
"Activate" = "Gweithredu";

/* No comment provided by engineer. */
"Activity Logs" = "Cofnodion Gweithgarwch";

/* No comment provided by engineer. */
"Add Self-Hosted Site" = "Ychwanegu Gwefan Hunan-Westeio";

/* Button title for Add SelfHosted Site */
"Add Site" = "Ychwanegu Gwefan";

/* The title on the add category screen */
"Add a Category" = "Ychwanegu Categori";

/* Placeholder text for the tags field. Should be the same as WP core. */
"Add a caption" = "Ychwanegu egluryn";

/* Placeholder text for the tags field. Should be the same as WP core. */
"Add a title" = "Ychwanegu teitl";

/* Placeholder text for the tags field. Should be the same as WP core. */
"Add alt text" = "Ychwanegu testun arall";

/* No comment provided by engineer. */
"Add media" = "Ychwanegu cyfrwng";

/* Label for url blog setting */
"Address" = "Cyfeiriad";

/* Description of albums in the photo libraries */
"Albums" = "Albumau";

/* No comment provided by engineer. */
"Alignment" = "Aliniad";

/* Displays all of the Notifications, unfiltered */
"All" = "Y Cyfan";

/* Insights all time section header */
"All-time posts, views, and visitors" = "Holl gofnodion, golygon ac ymwelwyr";

/* Label for the image's alt attribute. */
"Alt Text" = "Testun Amgen";

/* No comment provided by engineer. */
"An active internet connection is required to view stats" = "Mae angen cysylltiad rhyngrwyd gweithredol i weld yr ystadegau";

/* Error message in section when data failed. */
"An error occurred while retrieving data. Retry in a bit!" = "Digwyddodd gwall wrth estyn data. Ceisiwch eto cyn bo hir!";

/* the comment has an anonymous author. */
"Anonymous" = "Dienw";

/* Setting for enabling anonymous usage tracking */
"Anonymous Usage Tracking" = "Tracio Defnydd Anhysbys";

/* Section title for the appearance table section in the blog details screen. */
"Appearance" = "Gwedd";

/* No comment provided by engineer. */
"Approve" = "Cymeradwyo";

/* Unapprove a comment */
"Approved" = "Cymeradwywyd";

/* Title for the remove site confirmation alert, %@ will be replaced with iPhone/iPad/iPod Touch */
"Are you sure you want to continue?\n All site data will be removed from your %@." = "Ydych chi'n siŵr eich bod eisiau gwneud hyn?\nBydd holl ddata'r wefan yn cael eu tynnu o'ch %@.";

/* Message asking for confirmation on comment deletion */
"Are you sure you want to delete this comment?" = "Ydych chi'n siŵr eich bod am ddileu'r sylw hwn?";

/* Message asking for confirmation before marking a comment as spam */
"Are you sure you want to mark this comment as Spam?" = "Ydych chi'n siŵr eich bod am nodi'r sylw hwn fel sbam?";

/* Message for alert when user tries to send feedback without an email address */
"Are you sure you want to send without your email? We won't be able reply to you." = "Ydych chi'n siŵr eich bod am anfon heb eich e-bost? Byddwn ni ddim yn gallu'ch ateb chi.";

/* Title for prompt when user tries to close the feedback view */
"Are you sure?" = "Ydych chi'n siŵr?";

/* No comment provided by engineer. */
"Authenticating" = "Dilysu";

/* No comment provided by engineer. */
"Authentication Error" = "Gwall Dilysu";

/* Popup title to ask for user credentials. */
"Authentication required" = "Mae angen dilysiad";

/* No comment provided by engineer. */
"Author" = "Awdur";

/* Title for stats section for Authors */
"Authors" = "Awduron";

/* Title for stats section for post details average per day */
"Average per Day" = "Cyfartaledd Diwrnod";

/* No comment provided by engineer. */
"BG Color" = "Lliw BG";

/* Previous web page */
"Back" = "Nôl";

/* Message shown encouraging the user to leave a comment on a post in the reader. */
"Be the first to leave a commment." = "Bod y cyntaf i adael sylw.";

/* Stats Best Views label */
"Best Views Ever" = "Golygon Gorau Erioed";

/* Text for related post cell preview */
"Big iPhone\/iPad Update Now Available" = "Diweddariad iPhone\/iPad Mawr Nawr ar Gael";

/* Accessibility label for block quote button on formatting toolbar. */
"Block Quote" = "Dyfyniad Bloc";

/* The title of a button that triggers blocking a site from the user's reader. */
"Block This Site" = "Rhwystro'r Wefan";

/* Opens the WordPress Mobile Blog */
"Blog" = "Blog";

/* No comment provided by engineer. */
"Blog Posts" = "Cofnodion Blog";

/* No comment provided by engineer. */
"Blogs" = "Blogiau";

/* Accessibility label for bold button on formatting toolbar. */
"Bold" = "Trwm";

/* Title of a prompt letting the user know that they must wait until the current aciton completes. */
"Busy" = "Prysur";

/* Authors segmented control for stats */
"By Authors" = "Yn ôl Awdur";

/* Posts & Pages segmented control for stats */
"By Posts & Pages" = "Yn ôl Cofnod a Thudalen";

/* NUX Create Account TOS Label */
"By creating an account you agree to the fascinating Terms of Service." = "Drwy greu cyfrif rydych yn cytuno i'r tTelerau Gwasanaeth hynod ddiddorol.";

/* No comment provided by engineer. */
"Can't Access." = "Methu cael Mynediad.";

/* No comment provided by engineer. */
"Cancel" = "Diddymu";

/* Label for the button to cancel all progress. */
"Cancel All" = "Diddymu'r cyfan";

/* Title for alert for cancelling all uploads */
"Cancel Media Uploads" = "Diddymu Llwytho Cyfrwng";

/* Dialog box title for when the user is cancelling an upload. */
"Cancel media uploads" = "Diddymu llwytho cyfryngau";

/* The action was cancelled */
"Cancelled" = "Wedi ei ddiddymu";

/* Label for the caption field */
"Caption" = "Egluryn";

/* Title for the warning shown to the user when he refuses to re-login when the authToken is missing. */
"Careful!" = "Gofal!";

/* Label for the categories field. Should be the same as WP core. */
"Categories" = "Categorïau";

/* No comment provided by engineer. */
"Categories: %@" = "Categorïau: %@";

/* Error popup title to indicate that there was no category title filled in. */
"Category title missing." = "Teitl categori ar goll.";

/* Center alignment for an image. Should be the same as in core WP. */
"Center" = "Canol";

/* Popup title for wrong SSL certificate. */
"Certificate error" = "Gwall tystysgrif";

/* Title of an alert prompting the user that they are about to change the blog they are posting to. */
"Change Site" = "Newid Gwefan";

/* No comment provided by engineer. */
"Choose Photo" = "Dewis Llun";

/* And alert message warning the user they will loose blog specific edits like categories, and media if they change the blog being posted to. */
"Choosing a different site will lose edits to site specific content like media and categories. Are you sure?" = "Bydd dewis gwefan gwahanol yn colli golygiadau i gynnwys penodol y wefan fel cyfryngau a chategori. A ydych yn siŵr?";

/* No comment provided by engineer. */
"Clear Old Activity Logs" = "Clirio'r Hen Gofnodion Gweithgaredd";

/* Title for stats section for Clicks */
"Clicks" = "Cliciau";

/* No comment provided by engineer. */
"Close" = "Cau";

/* Placeholder text for the tags field. Should be the same as WP core. */
"Comma separated" = "Gwahanwyd gan atalnod";

/* Accessibility  Label for the Comment Button in the Reader. Tapping shows a screen that allows the user to comment a post. */
"Comment" = "Sylw";

/* Displayed when a Comment is removed */
"Comment has been deleted" = "Mae'r sylw wedi ei ddileu";

/* No comment provided by engineer. */
"Comments" = "Nodiadau";

/* Sentence fragment. The full phrase is 'Comments on' followed by the title of a post on a separate line. */
"Comments on" = "Sylwadau ar";

/* Notification Settings Channel */
"Comments on Other Sites" = "Sylwadau ar wefannau eraill";

/* Setting: indicates if New Comments will be notified */
"Comments on my site" = "Sylwadau ar fy ngwefan";

/* Setting: WordPress.com Community */
"Community" = "Cymuned";

/* The action is completed */
"Completed" = "Cwblhawyd";

/* Section title for the configuration table section in the blog details screen */
"Configuration" = "Ffurfweddiad";

/* Confirm */
"Confirm" = "Cadarnhau";

/* Notifications title displayed when a self-hosted user is not connected to Jetpack */
"Connect to Jetpack" = "Cysylltu i Jetpack";

/* Label for connecting to WordPress.com account */
"Connect to WordPress.com" = "Cysylltu i WordPress.com";

/* No comment provided by engineer. */
"Connecting to WordPress.com" = "Cysylltu â WordPress.com";

/* This is text that appears in the feedback view that we display when we prompt the user for an app review and they've indicated they don't like it and want to give us feedback */
"Contact" = "Cysylltu";

/* The text on the button at the bottom of the error message when a user has repeated trouble logging in */
"Contact Us" = "Cysylltu â Ni";

/* Post content */
"Content" = "Cynnwys";

/* Part of a prompt suggesting that there is more content for the user to read. */
"Continue reading" = "Parhau i ddarllen";

/* This is one of the buttons we display inside of the prompt to review the app */
"Could Be Better" = "Gallai Fod yn Well";

/* No comment provided by engineer. */
"Could not Follow Site" = "Methu Dilyn Gwefan";

/* No comment provided by engineer. */
"Could not Follow Topic" = "Methu Dilyn Pwnc";

/* No comment provided by engineer. */
"Could not Unfollow Site" = "Methu Dad-ddilyn Gwefan";

/* No comment provided by engineer. */
"Could not Unfollow Topic" = "Methu Dad Ddilyn Pwnc";

/* Error message informing the user that there was a problem subscribing to a site or feed. */
"Could not follow the site at the address specified." = "Methu dad-ddilyn gwefan yn y cyfeiriad hwn.";

/* An error description explaining that Follow could not be toggled due to a missing blogURL attribute. */
"Could not toggle Follow: missing blogURL attribute" = "Methu toglo Dilyn: priodwedd URL blog ar goll";

/* Error message informing the user that there was a problem unsubscribing to a site or feed. */
"Could not unfollow the site at the address specified." = "Methu dad-ddilyn gwefan yn y cyfeiriad hwn.";

/* This is the text we display to the user when we ask them for a review and they've indicated they don't like the app */
"Could you tell us how we could improve?" = "Dwedwch wrthym sut y gallwn wella?";

/* No comment provided by engineer. */
"Couldn't Connect" = "Methu Cysylltu";

/* The title for an alert that says to the user that the featured image he selected couldn't be uploaded. */
"Couldn't upload featured image" = "Methu llwytho'r ddelwedd dan sylw";

/* Message to show while media data source is finding the number of items available. */
"Counting media items..." = "Cyfrif eitemau cyfrwng...";

/* Title for stats section for Countries */
"Countries" = "Gwledydd";

/* No comment provided by engineer. */
"Country" = "Gwlad";

/* No comment provided by engineer. */
"Create Account" = "Creu Cyfrif";

/* NUX Create Account Page 1 Title */
"Create an account on WordPress.com" = "Creu cyfrif ar WordPress.com";

/* No comment provided by engineer. */
"Current" = "Cyfredol";

/* Denote a theme as the current */
"Current Theme" = "Y Thema Bresennol";

/* Notification Settings for your own blogs */
"Customize your site settings for Likes, Comments, Follows, and more." = "Cyfaddaswch eich gosodiadau gwefan ar gyfer Hoffi, Sylwadau, Dilyn a rhagor.";

/* Title of Days segmented control */
"Days" = "Diwrnod";

/* No comment provided by engineer. */
"Default Category" = "Categori Rhagosodedig";

/* No comment provided by engineer. */
"Default Post Format" = "Fformat Cofnod Rhagosodedig";

/* No comment provided by engineer. */
"Delete" = "Dileu";

/* Label for a button permanently deletes a page. */
"Delete Permanently" = "Dileu'n Barhol";

/* No comment provided by engineer. */
"Details" = "Manylion";

/* Button shown if there are unsaved changes and the author is trying to move away from the post. */
"Discard" = "Hepgor";

/* Button for confirming disconnecting WordPress.com account */
"Disconnect" = "Datgysylltu";

/* Label for disconnecting from WordPress.com account */
"Disconnect from WordPress.com" = "Datgysylltwch o WordPress.com";

/* Label for disconnecting WordPress.com account. The %@ is a placeholder for the user's screen name. */
"Disconnecting your account will remove all of @%@’s WordPress.com data from this device." = "Bydd datgysylltu eich cyfri yn dileu holl ddata WordPress.com @%@ o'r ddyfais hon.";

/* No comment provided by engineer. */
"Dismiss" = "Cau";

/* Accessibility label for display HTML button on formatting toolbar. */
"Display HTML" = "Dangos HTML";

/* No comment provided by engineer. */
"Done" = "Gorffen";

/* No comment provided by engineer. */
"Draft" = "Drafft";

/* No comment provided by engineer. */
"E-mail Support" = "Cynorth E-bost";

/* Used for Geo-tagging posts by latitude and longitude. Basic form. */
"East" = "Dwyrain";

/* No comment provided by engineer. */
"Edit" = "Golygu";

/* No comment provided by engineer. */
"Edit Comment" = "Golygu Sylw";

/* Button title, encourages users to schedule a draft post to publish. */
"Edit Drafts" = "Golygu Drafftiau";

/* Title of the edit image details screen. */
"Edit Image" = "Golygu Delwedd";

/* Page Editor screen title. */
"Edit Page" = "Golygu'r Dudalen";

/* Post Editor screen title. */
"Edit Post" = "Golygu Cofnod";

/* Title label for the editor settings section in the app settings */
"Editor" = "Golygydd";

/* No comment provided by engineer. */
"Email" = "E-bost";

/* No comment provided by engineer. */
"Email Address" = "Cyfeiriad E-bost";

/* Notification Settings Channel */
"Email from WordPress.com" = "E-bost gan WordPress.com";

/* No comment provided by engineer. */
"Empty URL" = "URL gwag";

/* Title of an alert view stating the user needs to turn on geotagging. */
"Enable Geotagging" = "Galluogi Geotagio";

/* No comment provided by engineer. */
"Enable Now" = "Galluogi Nawr";

/* Placeholder text prompting the user to type the name of the URL or tag they would like to follow. */
"Enter a URL or a tag to follow" = "Rhowch URL neu dag i ddilyn";

/* No comment provided by engineer. */
"Enter a password" = "Rhowch gyfrinair";

/* (placeholder) Help enter WordPress password */
"Enter password" = "Rhowch gyfrinair";

/* Message displayed when a verification code is needed */
"Enter the code on your authenticator app or " = "Rhowch y cod o'ch ap dilysu neu ";

/* Label for the title of the post field. Should be the same as WP core. */
"Enter title here" = "Rhowch deitl yma";

/* (placeholder) Help enter WordPress username */
"Enter username" = "Rhowch enw defnyddiwr";

/* No comment provided by engineer. */
"Error" = "Gwall";

/* Title of a prompt letting the user know there was an error trying to block a site from appearing in the reader. */
"Error Blocking Site" = "Gwall Wrth Rwystro Gwefan";

/* Text displayed when load post fails. */
"Error Loading Post" = "Gwall wrth Lwytho Cofnod";

/* Title of a prompt letting the user know there was an error trying to unblock a site from appearing in the reader. */
"Error Unblocking Site" = "Gwall wrth Dadrwystro Gwefan";

/* No comment provided by engineer. */
"Error loading page" = "Gwall wrth lwytho tudalen";

/* Text displayed in HUD after attempting to publish a post and an error occurred. */
"Error occurred\nduring publishing" = "Digwyddodd gwall\/n\nwrth gyhoeddi";

/* Text displayed in HUD after attempting to save a draft post and an error occurred. */
"Error occurred\nduring saving" = "Digwyddodd gwall\/n\nwrth gadw";

/* Text displayed in HUD after attempting to schedule a post and an error occurred. */
"Error occurred\nduring scheduling" = "Digwyddodd gwall\nwrth amserlennu";

/* No comment provided by engineer. */
"Error uploading." = "Gwall wrth lwytho.";

/* Label for the post author filter. This filter shows posts for all users on the blog. */
"Everyone" = "Pawb";

/* No comment provided by engineer. */
"Everything you write is solid gold." = "Mae popeth rydych yn ei ysgrifennu'n werth y byd";

/* Placeholder text for the tagline of a site */
"Explain what this site is about." = "Esboniwch bwrpas y wefan.";

/* No comment provided by engineer. */
"Extra Debug" = "Dadfygio Ychwanegol";

/* No comment provided by engineer. */
"Failed" = "Methwyd";

/* The title for an alert that says to the user the media (image or video) he selected couldn't be used on the post. */
"Failed to export media" = "Methu allforio cyfryngau";

/* No comment provided by engineer. */
"Featured Image" = "Delwedd Enghreifftiol";

/* No comment provided by engineer. */
"Featured Image did not load" = "Nid yw'r ddelwedd hon wedi llwytho";

/* No comment provided by engineer. */
"Feedback" = "Adborth";

/* A brief prompt shown when the comment list is empty, letting the user know the app is currently fetching new comments. */
"Fetching comments..." = "Estyn sylwadau…";

/* A brief prompt shown when the reader is empty, letting the user know the app is currently fetching new pages. */
"Fetching pages..." = "Estyn tudalennau...";

/* A brief prompt shown when the reader is empty, letting the user know the app is currently fetching new posts. */
"Fetching posts..." = "Estyn cofnodion...";

/* Title of the list of post status filters. */
"Filters" = "Hidlau";

/* Geo-tagging posts, status message when geolocation is found. */
"Finding your location..." = "Canfod eich lleoliad...";

/* No comment provided by engineer. */
"Follow" = "Dilyn";

/* Verb. An option to follow a site. */
"Follow Site" = "Dilyn Gwefan";

/* User followed a site. */
"Followed" = "Dilyn";

/* Page title for the list of followed sites. */
"Followed Sites" = "Gwefannau Rwy'n eu Dilyn";

/* Page title for the list of subscribed topics. */
"Followed Topics" = "Pwnc sy'n cael ei ddilyn";

/* Short confirmation that unfollowing a site was successful */
"Followed site" = "Gwefan sy'n cael ei dilyn";

/* No comment provided by engineer. */
"Follower" = "Dilynwr";

/* Title for stats section for Followers */
"Followers" = "Dilynwyr";

/* No comment provided by engineer. */
"Following" = "Yn dilyn";

/* Filters Follows Notifications */
"Follows" = "Yn Dilyn";

/* NSMicrophoneUsageDescription: Sentence to justify why the app asks permission from the user to access the device microphone. */
"For your videos to have sound on them." = "I'ch fideoai fod â sain.";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error accessing the site. */
"Forbidden Access" = "Dim Mynediad";

/* Next web page */
"Forward" = "Ymlaen";

/* Full size image. (default). Should be the same as in core WP. */
"Full Size" = "Maint Llawn";

/* Title for the gallery button in the ReaderPostCardCell */
"Gallery" = "Gallery";

/* Title for the general section in site settings screen */
"General" = "Cyffredinol";

/* Label for the geolocation feature (tagging posts by their physical location). */
"Geolocation" = "Geoleoliad";

/* Enables geotagging in blog settings (short label) */
"Geotagging" = "Geotagio";

/* Message of an alert explaining that geotagging need to be enabled. */
"Geotagging is turned off. \nTo update this post's location, please enable geotagging in this site's settings." = "Mae Geotagio wedi'i ddiffodd. \nI ddiweddaru lleoliad y cofnod hwn, galluogwch geotagio yng ngosodiadau’r wefan.";

/* No comment provided by engineer. */
"Getting account information" = "Estyn manylion cyfrif";

/* No comment provided by engineer. */
"Give Up" = "Rhoi'r Gorau";

/* Opens WPiOS Settings.app Section */
"Go to iPhone Settings" = "Mynd i iPhone Settings";

/* This is the text we display to the user when we ask them for a review and they've indicated they like the app */
"Great! Could you leave us a nice review?\n\nIt really helps." = "Gwych! Gallwch adael adolygiad da i ni?\n\nMae wir yn helpu.";

/* This is the text we display to the user when we ask them for a review and they've indicated they like the app */
"Great! Could you leave us a nice review?\nIt really helps." = "Gwych! Hoffech chi adael adolygiad da i ni?\n\nMae wir yn helpu.";

/* Displayed as the 'close' button label on the What's New dialog. A short acknowledgement that the user is aware of the new features. Tapping dismisses the dialog. */
"Great, thanks!" = "Gwych, diolch!";

/* Accessibility label for HTML button on formatting toolbar. */
"HTML" = "HTML";

/* Help button */
"Help" = "Cymorth";

/* No comment provided by engineer. */
"Help & Support" = "Cymorth a Chefnogaeth";

/* Text for privacy settings: Hidden */
"Hidden" = "Cudd";

/* No comment provided by engineer. */
"Hide keyboard" = "Cuddio bysellfwrdd";

/* NUX First Walkthrough Page 1 Description */
"Hold the web in the palm of your hand. Full publishing power in a pint-sized package." = "Daliwch y we yng nghledr eich llaw. Pŵer cyhoeddi llawn mewn pecyn o faint peint.";

/* This is text that appears in the feedback view that we display when we prompt the user for an app review and they've indicated they don't like it and want to give us feedback */
"How can we help?" = "Sut y gallwn helpu?";

/* This is one of the buttons we display inside of the prompt to review the app */
"I Like It" = "Rydw i'n ei Hoffi";

/* Ignore action. Verb */
"Ignore" = "Anwybyddu";

/* Title of the screen for choosing an image's size. */
"Image Size" = "Maint Delwedd";

/* No comment provided by engineer. */
"Image unavailable" = "Nid yw'r ddelwedd ar gael";

/* No comment provided by engineer. */
"Immediately" = "Ar unwaith";

/* In _ days, Days duration single character abbreviation */
"In %id" = "Ymhen %id";

/* In _ hours, Hours duration single character abbreviation */
"In %ih" = "Ymhen %ih";

/* In _ minutes, Minutes duration single character abbreviation */
"In %im" = "Ymhen %im";

/* Explain what is the purpose of the tagline */
"In a few words, explain what this site is about." = "Esboniwch, mewn ychydig eiriau, bwrpas y wefan.";

/* A short phrase indicating something due to happen in a few moments. An example is when a scheduled post will published in under a minute. */
"In seconds" = "Ymhen ychydig eiliadau";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error being returned from the site. */
"Incompatible site" = "Gwefan anghydnaws";

/* Info alert title */
"Info" = "Gwybodaeth";

/* WordPress.com Community Footer Text */
"Information on WordPress.com courses and events (online & in-person)." = "Gwybodaeth am gyrsiau a digwyddiadau WordPress.com (ar-lein a byw).";

/* Insert content (link, media) button */
"Insert" = "Mewnosod";

/* Accessibility label for insert image button on formatting toolbar. */
"Insert Image" = "Mewnosod Delwedd";

/* Accessibility label for insert link button on formatting toolbar. */
"Insert Link" = "Mewnosod Cyswllt";

/* Title of Insights segmented control */
"Insights" = "Mewnwelediad";

/* No comment provided by engineer. */
"Install Jetpack" = "Gosod Jetpack";

/* No comment provided by engineer. */
"Internal Beta" = "Beta Mewnol";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error accessing the site, most likely due to an error with the server hosting the WP install. */
"Internal Server Error" = "Gwall Gweinydd Mewnol";

/* Title for alert that a user has entered an invalid email address */
"Invalid Email Address." = "Cyfeiriad E-bost Annilys.";

/* No comment provided by engineer. */
"Invalid Site Address" = "Cyfeiriad gwefan annilys";

/* No comment provided by engineer. */
"Invalid Site Title" = "Teitl Gwefan Annilys";

/* No comment provided by engineer. */
"Invalid URL" = "URL Annilys";

/* No comment provided by engineer. */
"Invalid username" = "Enw defnyddiwr annilys";

/* No comment provided by engineer. */
"Invalid username or password" = "Enw defnyddiwr neu gyfrinair annilys";

/* Prompts the user the username or password they entered was incorrect. */
"Invalid username\/password. Please update your credentials and try again." = "Enw defnyddiwr\/cyfrinair annilys. Diweddarwch eich manylion a cheisiwch eto.";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error accessing the site, most likely due to an error with the server hosting the WP install, but may be a temporary issue. */
"It seems your WordPress site is not accessible at this time, please try again later" = "Mae'n ymddangos nad yw eich gwefan WordPress yn hygyrch ar hyn o bryd, rhowch gynnig arni nes ymlaen";

/* Latest post summary text including placeholder for time and the post title. */
"It's been %@ since %@ was published. Here's how the post has performed so far..." = "Mae wedi bod yn %1$@ ers i %2$@ gael ei gyhoeddi. Dyma sut mae'r cofnod wedi gwneud ers hynny...";

/* Accessibility label for italic button on formatting toolbar. */
"Italic" = "Italig";

/* No comment provided by engineer. */
"Jetpack %@ or later is required for stats. Do you want to update Jetpack?" = "Mae angen ategyn Jetpack 1.8.2 neu ddiweddarach ar gyfer adrodd ar yr ystadegau. Hoffech chi ddiweddaru Jetpack?";

/* No comment provided by engineer. */
"Jetpack Connect" = "Jetpack Connect";

/* No comment provided by engineer. */
"Jetpack REST" = "Jetpack REST";

/* No comment provided by engineer. */
"Jetpack Sign In" = "Mewngofnodi i Jetpack";

/* No comment provided by engineer. */
"Jetpack is required for stats. Do you want to install Jetpack?" = "Mae angen Jetpack ar gyfer yr ystadegau. Hoffech chi osod Jetpack?";

/* Notifications message displayed when a self-hosted user is not connected to Jetpack */
"Jetpack supercharges your self-hosted WordPress site." = "Mae Jetpack yn ymrymuso ei gwefan hunan-westeio WordPress.";

/* A short phrase indicating something that happened moments ago. An example is when a post was published less than a minute ago. */
"Just now" = "Newydd ddigwydd";

/* Button shown if there are unsaved changes and the author is trying to move away from the post. */
"Keep Editing" = "Cadw i Olygu";

/* Large image size. Should be the same as in core WP. */
"Large" = "Mawr";

/* Insights latest post summary section header */
"Latest Post Summary" = "Crynodeb Cofnodion Diweddar";

/* No comment provided by engineer. */
"Learn more" = "Dysgu rhagor";

/* This is one of the buttons we display when prompting the user for a review */
"Leave a Review" = "Gadael Adolygiad";

/* Left alignment for an image. Should be the same as in core WP. */
"Left" = "Chwith";

/* No comment provided by engineer. */
"Like" = "Hoffi";

/* No comment provided by engineer. */
"Liked" = "Hoffwyd";

/* No comment provided by engineer. */
"Likes" = "Hoffi";

/* Setting: indicates if Comment Likes will be notified */
"Likes on my comments" = "Hoffi ar fy sylwadau";

/* Setting: indicates if Replies to your comments will be notified */
"Likes on my posts" = "Hoffi ar fy nghofnodion";

/* No comment provided by engineer. */
"Limit reached. You can try again in 1 minute. Trying again before that will only increase the time you have to wait before the ban is lifted. If you think this is in error, contact support." = "Wedi cyrraedd y terfyn. Gallwch geisio eto mewn 1 munud. Bydd ceisio eto cyn yn cynyddu amser fydd gennych cyn codi'r gwaharddiad. Os ydych chi'n credu bod hwn yn gamgymeriad, cysylltwch â Cymorth.";

/* No comment provided by engineer. */
"Link" = "Cyswllt i";

/* No comment provided by engineer. */
"Link Name" = "Enw Dolen";

/* Image link option title */
"Link To" = "Cysylltu â";

/* Popup to aid in creating a Link in the Post Editor, URL field (where you can type or paste a URL that the text should link. */
"Link URL" = "Dolen URL";

/* Section title for the default reader lists */
"Lists" = "Rhestrau";

/* No comment provided by engineer. */
"Live Preview" = "Rhagolwg Byw";

/* A short label.  A call to action to load more posts. */
"Load more posts" = "Llwytho rhagor o gofnodion";

/* Text displayed while loading a post. */
"Loading Post..." = "Llwytho Cofnod...";

/* A short message to inform the user the requested stream is being loaded. */
"Loading stream..." = "Llwytho llif...";

/* No comment provided by engineer. */
"Loading..." = "Llwytho...";

/* A status label for a post that only exists on the user's iOS device, and has not yet been published to their blog. */
"Local" = "Lleol";

/* Message of an alert explaining that location services need to be enabled. */
"Location Services are turned off. \nTo add or update this post's location, please enable Location Services in the Settings app." = "Mae Gwasanaethau Lleoli wedi eu diffodd. \nI ychwanegu neu ddiweddaru lleoliad y cofnod hwn, galluogwch Gwasanaethau Lleoli yng ngosodiadau’r ap.";

/* Title of an alert view stating that the user's location is unavailable. */
"Location Unavailable" = "Nid yw'r Lleoliad ar gael";

/* Used when geo-tagging posts, if the geo-tagging failed. */
"Location unknown" = "Lleoliad anhysbys";

/* No comment provided by engineer. */
"Log Files By Created Date" = "Ffeiliau Cofnod yn ôl Dyddiad Creu";

/* Log In button label. */
"Log In" = "Mewngofnodi";

/* Login Request Expired */
"Login Request Expired" = "Daeth y Cais Mewngofnodi i Ben";

/* No comment provided by engineer. */
"Logs" = "Cofnodion";

/* Used with posts that are geo-tagged. Let's the user know the the app is looking up the address for the coordinates tagging the post. */
"Looking up address..." = "Cyfeiriad chwilio...";

/* No comment provided by engineer. */
"Looks like you have Jetpack set up on your site. Congrats!\nSign in with your WordPress.com credentials below to enable Stats and Notifications." = "Mae'n edrych fel bod gennych Jetpack wedi ei osod ar eich gwefan. Llongyfarchiadau!\nMewngofnodwch gyda'ch manylion WordPress.com isod i alluogi Ystadegau a Hysbysiadau.";

/* No comment provided by engineer. */
"Lost your password?" = "Wedi colli eich cyfrinair?";

/* No comment provided by engineer. */
"Mail" = "E-bost";

/* No comment provided by engineer. */
"Main Navigation" = "Llywio";

/* Title of the Link Helper popup to aid in creating a Link in the Post Editor. */
"Make a Link" = "Creu Dolen";

/* Title for the image size settings option. */
"Max Image Upload Size" = "Maint mwyaf Llwytho Delwedd";

/* Me page title */
"Me" = "Fi";

/* Title label for the media settings section in the app settings */
"Media" = "Cyfrwng";

/* Title for alert when access to media capture is not granted */
"Media Capture" = "Cipio Cyfrwng";

/* No comment provided by engineer. */
"Media Library" = "Llyfrgell Cyfrwng";

/* Title for view that shows progress of multiple uploads */
"Media Uploading" = "Llwytho Cyfryngau";

/* Message to indicate progress of uploading media to server */
"Media Uploading..." = "Llwytho Cyfryngau...";

/* The title for an alert that says to the user the media (image or video) failed to be uploaded to the server. */
"Media upload failed" = "Methodd llwytho'r ddelwedd";

/* Medium image size. Should be the same as in core WP. */
"Medium" = "Canolig";

/* No comment provided by engineer. */
"Menu" = "Dewislen";

/* Title of Months segmented control */
"Months" = "Mis";

/* Title for stats section for post details months & years */
"Months and Years" = "Misoedd a Blynyddoedd";

/* No comment provided by engineer. */
"More" = "Rhagor";

/* No comment provided by engineer. */
"More information" = "Rhagor o wybodaeth";

/* Title of more periods segmented control */
"More…" = "Rhagor...";

/* Insights most popular day section label */
"Most popular day" = "Diwrnod mwyaf poblogaidd";

/* Insights popular section header */
"Most popular day and hour" = "Diwrnod ac awr mwyaf poblogaid";

/* Insights most popular hour section label */
"Most popular hour" = "Awr mwyaf poblogaidd";

/* Label for a button that moves a page to the draft folder */
"Move to Draft" = "Symud i'r Drafft";

/* Label for a button that moves a page to the trash folder */
"Move to Trash" = "Symud i'r Sbwriel";

/* No comment provided by engineer. */
"My Sites" = "Gwefannau";

/* 'Need help?' button label, links off to the WP for iOS FAQ. */
"Need Help?" = "Angen Cymorth?";

/* New Page Editor screen title. */
"New Page" = "Tudalen Newydd";

/* No comment provided by engineer. */
"New Post" = "Cofnod Newydd";

/* Theme sort, newest themes */
"Newest" = "Diweddaraf";

/* No comment provided by engineer. */
"No" = "Na";

/* No comment provided by engineer. */
"No Connection" = "Dim Cysylltiad";

/* No comment provided by engineer. */
"No Description available for this Post" = "Nid oes disgrifiad gael ar gyfer Cofnod hwn";

/* Title for alert when user tires to send feedback without an email address */
"No Email." = "Dim E-bost.";

/* Text that appears in an alert to the user when there is no internet */
"No Internet" = "Dim Rhyngrwyd";

/* Title for message when user tries to send feedback without any text */
"No Message." = "Dim Neges.";

/* Title of a message explaining that the user is not currently following any blogs in their reader. */
"No Sites" = "Dim Gwefannau";

/* This is one of the buttons we display when prompting the user for a review */
"No Thanks" = "Dim Diolch";

/* No comment provided by engineer. */
"No clicks recorded" = "Dim cliciau wedi eu cofnodi";

/* Displayed in the Notifications Tab, when the Comments Filter shows no notifications */
"No comments notifications" = "Dim hysbysiadau sylwadau";

/* No comment provided by engineer. */
"No comments posted" = "Dim sylwadau wedi eu cyhoeddi";

/* Displayed when the user pulls up the comments view and they have no comments */
"No comments yet" = "Dim sylwadau eto";

/* No comment provided by engineer. */
"No countries recorded" = "Heb gofnodi gwledydd";

/* The '%@' is a placeholder for the search term. */
"No drafts match your search for %@" = "Does dim drafftiau'n cyweddu â'ch chwilio am %@";

/* No comment provided by engineer. */
"No followers" = "Dim dilynwyr";

/* No comment provided by engineer. */
"No items published during this timeframe" = "Dim eitemau wedi eu cyhoeddi yn ystod y cyfnod hwn";

/* Displayed in the Notifications Tab, when the Likes Filter shows no notifications */
"No like notifications" = "Dim hysbysiadau hoffi";

/* A message title */
"No likes yet" = "Dim hoffi eto";

/* Displayed in the Notifications Tab, when the Follow Filter shows no notifications */
"No new followers notifications" = "Dim hysbysiadau dilynwyr newydd";

/* Displayed in the Notifications Tab, when there are no notifications */
"No notifications yet" = "Dim hysbysiadau eto";

/* The '%@' is a placeholder for the search term. */
"No pages match your search for %@" = "Does dim tudalennau'n cydweddu â'ch chwilio am %@";

/* A message title */
"No posts" = "Dim cofnodion";

/* A default message shown whe the reader can find no post to display */
"No posts have been made recently" = "Dim confodion yn ddiweddar";

/* Message shown whent the reader finds no posts for the chosen tag */
"No posts have been made recently with this tag." = "Does dim cofnod gyda'r tag hwn wedi ei wneud yn ddiweddar.";

/* The '%@' is a placeholder for the search term. */
"No posts match your search for %@" = "Does dim cofnodion yn cydweddu â'ch chwilio am %@ ";

/* No comment provided by engineer. */
"No posts or pages viewed" = "Dim cofnodion na thudalennau wedi eu darllen";

/* No comment provided by engineer. */
"No publicize followers recorded" = "Dim dilynwyr publicize wedi ei cofnodi";

/* A message title */
"No recent posts" = "Dim cofnodion diweddar";

/* No comment provided by engineer. */
"No referrers recorded" = "Dim cyfeirwyr wedi eu cofnodi";

/* The '%@' is a placeholder for the search term. */
"No scheduled pages match your search for %@" = "Does dim tudalennau wedi eu hamseru yn cydweddu â'ch chwilio am %@ ";

/* The '%@' is a placeholder for the search term. */
"No scheduled posts match your search for %@" = "Does dim cofnodion wedi eu hamseru yn cydweddu â'ch chwilio am %@ ";

/* No comment provided by engineer. */
"No search terms recorded" = "Heb gofnodi geiriau chwilio";

/* No comment provided by engineer. */
"No tagged posts or pages viewed" = "Dim cofnodion wedi'u tagio na thudalennau wedi eu darllen";

/* No comment provided by engineer. */
"No themes to display" = "Dim themâu’n cael eu dangos";

/* The '%@' is a placeholder for the search term. */
"No trashed pages match your search for %@" = "Nid oes tudalennau wedi eu chwalu'n cyfateb i'ch chwilio am %@";

/* The '%@' is a placeholder for the search term. */
"No trashed posts match your search for %@" = "Nid oes cofnodion wedi eu chwalu'n cyfateb i'ch chwilio am %@ ";

/* Displayed in the Notifications Tab, when the Unread Filter shows no notifications */
"No unread notifications" = "Dim hysbysiadau heb eu darllen";

/* No comment provided by engineer. */
"No videos played" = "Dim fideos wedi eu chwarae";

/* No alignment for an image (default). Should be the same as in core WP. */
"None" = "Dim";

/* Used for Geo-tagging posts by latitude and longitude. Basic form. */
"North" = "Gogledd";

/* Nicer dialog answer for \"No\". */
"Not Now" = "Nid nawr";

/* No comment provided by engineer. */
"Notification Settings" = "Gosodiadau Hysbysu";

/* No comment provided by engineer. */
"Notifications" = "Hysbysiadau";

/* WordPress.com Notifications Timeline */
"Notifications Tab" = "Tab Hysbysiadau";

/* Notifications tab bar item accessibility label, unread notifications state */
"Notifications Unread" = "Hysbysiadau heb ei Darllen";

/* No comment provided by engineer. */
"OK" = "Iawn";

/* Disabled */
"Off" = "Diffodd";

/* No comment provided by engineer. */
"Ok" = "Iawn";

/* Notifications +2 Days Section Header */
"Older than 2 days" = "Hŷn na 2 ddiwrnod";

/* Notifications Months Section Header */
"Older than a Month" = "Hŷn na Mis";

/* Notifications Weeks Section Header */
"Older than a Week" = "Hŷn nag Wythnos";

/* Label for the post author filter. This fliter shows posts only authored by the current user. */
"Only Me" = "Dim ond Fi";

/* Title for the warning shown to the user when the app realizes there should be an auth token but there isn't one. */
"Oops!" = "Wps!";

/* Go to the settings app */
"Open Settings" = "Agor y Gosodiadau";

/* No comment provided by engineer. */
"Open in Safari" = "Agor yn Safari";

/* WordPress.com Research Footer Text */
"Opportunities to participate in WordPress.com research & surveys." = "Cyfleoedd i gymryd rhan mewn ymchwil a holiaduron WordPress.com";

/* Placeholder to indicate that filling out the field is optional. */
"Optional" = "Dewisol";

/* No comment provided by engineer. */
"Options" = "Dewisiadau";

/* No comment provided by engineer. */
"Order By" = "Trefnu ynôl";

/* Accessibility label for ordered list button on formatting toolbar. */
"Ordered List" = "Rhestr Drefnus";

/* Label title. Indicates an image will use its original size when uploaded. */
"Original" = "Gwreiddiol";

/* Used to attribute a post back to its original author.  The '%@' characters are a placholder for the author's name. */
"Originally posted by %@" = "Cofnodwyd yn wreiddiol gan %@";

/* Used to attribute a post back to its original author and blog.  The '%@' characters are placholders for the author's name, and the author's blog repsectively. */
"Originally posted by %@ on %@" = "Cofnodwyd yn wreiddiol gan %1$@ ar %2$@";

/* Used to attribute a post back to its original blog.  The '%@' characters are a placholder for the blog name. */
"Originally posted on %@" = "Wedi ei gofnodi'n wreiddiol ar %@";

/* Displayed in the Notification Settings View */
"Other" = "Arall";

/* Non-periodic stats module header in Insights */
"Other Recent Stats" = "Ystadegau Diweddar Eraill";

/* No comment provided by engineer. */
"Other Sites" = "Gwefannau Eraill";

/* No comment provided by engineer. */
"Overall" = "O'r Cyfan";

/* A short message explaining that a page was moved to the trash bin. */
"Page moved to trash." = "Symudwyd y dudalen i'r sbwriel.";

/* Placeholder text for the title field on Pages screen. */
"Page title" = "Teitl y dudalen";

/* Tile of the screen showing the list of pages for a blog. */
"Pages" = "Tudalennau";

/* No comment provided by engineer. */
"Parent Category" = "Categori Rhiant";

/* No comment provided by engineer. */
"Password" = "Cyfrinair";

/* No comment provided by engineer. */
"Password protected" = "Diogelu gyda chyfrinair";

/* No comment provided by engineer. */
"Pending" = "Dan Ystyriaeth";

/* Title for alert when trying to publish a post with failed media items */
"Pending media" = "Cyfrwng dan ystyriaeth";

/* No comment provided by engineer. */
"Pending moderation" = "Dan ystyriaeth";

/* Name for the status of a post pending review. */
"Pending review" = "Disgwyl adolygiad";

/* No comment provided by engineer. */
"Period" = "Cyfnod";

/* Message for alert that user has entered an invalid email address */
"Please check your email address, it appears to be invalid." = "Gwiriwch eich cyfeiriad e-bost, mae'n ymddangos ei fod yn annilys.";

/* Politely asks the user to check their internet connection before trying again. */
"Please check your internet connection and try again." = "Gwiriwch eich cysylltiad rhyngrwyd a cheisiwch eto.";

/* Message for alert when user tires to send feedback without any text */
"Please enter a message." = "Rhowch eich neges.";

/* No comment provided by engineer. */
"Please enter a site address." = "Rhowch gyfeiriad gwefan.";

/* No comment provided by engineer. */
"Please enter a username." = "Rhowch enw defnyddiwr.";

/* No comment provided by engineer. */
"Please enter a valid email address." = "Rhowch gyfeiriad e-bost dilys.";

/* No comment provided by engineer. */
"Please enter the URL of your WordPress site." = "Rhowch URL eich gwefan WordPress.";

/* Popup message to ask for user credentials (fields shown below). */
"Please enter your credentials" = "Rhowch eich manylion";

/* No comment provided by engineer. */
"Please fill out all the fields" = "Llenwch pob maes";

/* No comment provided by engineer. */
"Please leave your comments above this line." = "Gadewch eich sylwadau uwchlaw'r linell hon.";

/* No comment provided by engineer. */
"Please try entering your login details again." = "Ceisiwch fewngofnodi eto.";

/* Asks the usre to wait until the currently running fetch request completes. */
"Please wait til the current fetch completes." = "Arhoswch nes bod yr estyn cyfredol yn cwblhau.";

/* Theme sort, popular themes */
"Popular" = "Poblogaidd";

/* Page title for the list of recommended topics when signed into wpcom. */
"Popular Tags" = "Tagiau Poblogaidd";

/* No comment provided by engineer. */
"Post" = "Cofnod";

/* Title for selecting categories for a post */
"Post Categories" = "Categoriau Cofnodion";

/* No comment provided by engineer. */
"Post Format" = "Fformat Cofnod";

/* Prompts the user that a restored post was moved to the drafts list. */
"Post Restored to Drafts" = "Wedi Adfer Cofnod i'r Drafftiau";

/* Prompts the user that a restored post was moved to the published list. */
"Post Restored to Published" = "Cofnod wedi ei Adfer i Cyhoeddwyd";

/* Prompts the user that a restored post was moved to the scheduled list. */
"Post Restored to Scheduled" = "Cofnod wedi ei Adfer i Amserlennwyd";

/* No comment provided by engineer. */
"Post anyway" = "Cofnodi beth bynnag";

/* A short message explaining that a post was moved to the trash bin. */
"Post moved to trash." = "Mae'r cofnod wedi ei symud i'r Sbwriel.";

/* Placeholder for the post title. */
"Post title" = "Teitl cofnod";

/* No comment provided by engineer. */
"Posts" = "Cofnodion";

/* Title for stats section for Posts & Pages */
"Posts & Pages" = "Cofnod a Thudalen";

/* A message explaining the Posts I Like feature in the reader */
"Posts that you like will appear here." = "Bydd cofnodion rydych yn eu hoffi yn ymddangos yn fan hyn.";

/* Label to show while converting and/or resizing media to send to server */
"Preparing..." = "Paratoi...";

/* No comment provided by engineer. */
"Preview" = "Rhagolwg";

/* No comment provided by engineer. */
"Preview post" = "Rhagolwg post";

/* No comment provided by engineer. */
"Privacy" = "Preifatrwydd";

/* Opens the Privacy Policy Web */
"Privacy Policy" = "Polisi Preifatrwydd";

/* No comment provided by engineer. */
"Private" = "Preifat";

/* Name for the status of a post that is marked private. */
"Privately published" = "Cyhoeddwyd yn breifat";

/* Title of a prompt */
"Problem Following Site" = "Anhawster Dilyn Gwefan";

/* Title of a prompt */
"Problem Unfollowing Site" = "Anhawster Dad-ddilyn Gwefan";

/* Error message title informing the user that a stream could not be loaded. */
"Problem loading stream" = "Anhawster llwytho llif";

/* Message for the warning shown to the user when he refuses to re-login when the authToken is missing. */
"Proceeding will remove all WordPress.com data from this device, and delete any locally saved drafts. You will not lose anything already saved to your WordPress.com blog(s)." = "Bydd parhau'n golygu tynnu data WordPress.com i gyd o'r ddyfais hon a dileu'r drafftiau lleol rydych wedi'u cadw. Byddwch chi ddim yn colli dim wedi ei gadw i'ch blog(iau) WordPress.com.";

/* No comment provided by engineer. */
"Public" = "Cyhoeddus";

/* Title for stats section for Publicize */
"Publicize" = "Publicize";

/* No comment provided by engineer. */
"Publish" = "Cyhoeddi";

/* No comment provided by engineer. */
"Publish Immediately" = "Cyhoeddi'n Syth";

/* No comment provided by engineer. */
"Published" = "Cyhoeddwyd";

/* Published on [date] */
"Published on" = "Cyhoeddwyd ar";

/* Text displayed in HUD after a post was successfully published. */
"Published!" = "Cyhoeddwyd!";

/* Mobile Push Notifications */
"Push Notifications" = "Hysbysiadau Gwthio";

/* Displayed when Push Notifications are disabled (iOS 7) */
"Push Notifications have been turned off in iOS Settings" = "Mae Gosodiadau Gwthio wedi eu diffodd yn iOS Settings.";

/* Suggests to enable Push Notification Settings in Settings.app */
"Push Notifications have been turned off in iOS Settings App. Toggle \"Allow Notifications\" to turn them back on." = "Mae Hysbysiadau Gwthio wedi eu diffodd yn Ap Gosodiadau iOS. Toglwch \"Allow Notifications\" i'w cychwyn eto.";

/* Prompts the user to rate us on the store */
"Rate us on the App Store" = "Barnwch ni yn yr App Store";

/* No comment provided by engineer. */
"Reader" = "Darllennydd";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error accessing the site. */
"Received 'Forbidden Access'.\nIt seems there is a problem with your WordPress site" = "Dderbyniwyd 'Dim Mynediad'.\nMae'n ymddangos bod anhawster gyda'ch gwefan WordPress";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error accessing the site, most likely due to an error with the server hosting the WP install. */
"Received 'Internal Server Error'.\nIt seems there is a problem with your WordPress site" = "Dderbyniwyd 'Gwall Mewnol Gweinydd'. \nMae'n ymddangos bod anhawster gyda'ch gwefan WordPress";

/* Title for stats section for post details recent weeks */
"Recent Weeks" = "Wythnosau Diweddar";

/* A message explaining the Following topic in the reader */
"Recent posts from blogs and sites you follow will appear here." = "Bydd cofnodion gan flogiau a gwefannau rydych yn eu dilyn yn ymddangos yma.";

/* No comment provided by engineer. */
"Referrer" = "Cyfeiriwr";

/* Title for stats section for Referrers */
"Referrers" = "Cyfeirwyr";

/* No comment provided by engineer. */
"Related Posts" = "Cofnodion sy'n Perthyn";

/* Information of what related post are and how they are presented */
"Related Posts displays relevant content from your site below your posts" = "Mae Cofnodion Perthynol yn dangos cynnwys perthnasol o'ch gwefan islaw eich cofnodion.";

/* Information of what related post are and how they are presented. */
"Related Posts displays relevant content from your site below your posts." = "Mae Cofnodion Perthynol yn dangos cynnwys perthnasol o'ch gwefan islaw eich cofnodion. ";

/* No comment provided by engineer. */
"Remove" = "Tynnu";

/* Accessibility  Label for the Remove Feature Image icon. Tapping will show a confirmation screen for removing the feature image from the post. */
"Remove Featured Image" = "Tynnu'r Ddelwedd Nodwedd";

/* User action to remove image that failed upload */
"Remove Image" = "Tynnu'r Ddelwedd";

/* Accessibility label for remove link button on formatting toolbar. */
"Remove Link" = "Tynnu dolen";

/* No comment provided by engineer. */
"Remove Site" = "TynnuGwefan";

/* User action to remove video that failed upload */
"Remove Video" = "Tynnu'r Fideo";

/* Prompt when removing a featured image from a post */
"Remove this Featured Image?" = "Tynnu'r Ddelwedd Nodwedd?";

/* Setting: indicates if Replies to Comments will be notified */
"Replies to your comments" = "Atebion i'ch sylwadau";

/* No comment provided by engineer. */
"Reply" = "Ateb";

/* The app successfully sent a comment */
"Reply Sent!" = "Anfonwyd Ymateb!";

/* Placeholder text for replying to a comment */
"Reply to comment…" = "Ymateb i sylw...";

/* Placeholder text for replying to a post */
"Reply to post…" = "Ymateb i gofnod...";

/* Setting: WordPress.com Surveys */
"Research" = "Ymchwil";

/* Title of the reset button */
"Reset" = "Ailosod";

/* Label for restoring a trashed post. */
"Restore" = "Adfer";

/* Retry. Action */
"Retry" = "Ceisiwch eto";

/* No comment provided by engineer. */
"Retry Upload" = "Ailgynnig llwytho";

/* No comment provided by engineer. */
"Retry?" = "Ceisio eto?";

/* Right alignment for an image. Should be the same as in core WP. */
"Right" = "De";

/* One Time Code has been sent via SMS */
"SMS Sent" = "SMS wedi ei anfon";

/* No comment provided by engineer. */
"Save" = "Cadw";

/* Button shown if there are unsaved changes and the author is trying to move away from the post. */
"Save Draft" = "Cadw'r Drafft";

/* No comment provided by engineer. */
"Saved to %@" = "Cadwyd i %@";

/* Text displayed in HUD after a post was successfully saved as a draft. */
"Saved!" = "Cadwyd!";

/* Schedule button, this is what the Publish button changes to in the Post Editor if the post has been scheduled for posting later. */
"Schedule" = "Amserlennu";

/* No comment provided by engineer. */
"Scheduled" = "Amserlenwyd";

/* Scheduled for [date] */
"Scheduled for" = "Amserlenwyd ar gyfer";

/* Text displayed in HUD after a post was successfully scheduled to be published. */
"Scheduled!" = "Amserlenwyd!";

/* Placeholder text for the search bar on the post screen. */
"Search" = "Chwilio";

/* Title for stats section for Search Terms */
"Search Terms" = "Geiriau Chwilio";

/* No comment provided by engineer. */
"Select Language" = "Dewis Iaith";

/* No comment provided by engineer. */
"Select Site" = "Dewiswch wefan";

/* Blog list page edit mode header label */
"Select which sites will be shown in the site picker." = "Dewiswch pa wefannau fydd yn cael eu dangos wrth ddewis gwefan.";

/* No comment provided by engineer. */
"Self-hosted site?" = "Gwefan hunanwesteio?";

/* Verb, submit a comment reply */
"Send" = "Anfon";

/* This is one of the buttons we display when prompting the user for a review */
"Send Feedback" = "Anfon Adborth";

/* Label that is shown when feedback from the user is sending */
"Sending..." = "Anfon...";

/* No comment provided by engineer. */
"Service" = "Gwasanaeth";

/* No comment provided by engineer. */
"Set Featured Image" = "Gosod Delwedd Nodwedd";

/* Geolocation feature to set the location. */
"Set Location" = "Gosod Lleoliad";

/* No comment provided by engineer. */
"Settings" = "Gosodiadau";

/* Descriptive text for the Notifications Tab Settings */
"Settings for notifications that appear in the Notifications tab." = "Gosodiadau ar gyfer hysbysiadau sy'n ymddangos yn y tab Hysbysiadau.";

/* Descriptive text for the Email Notifications Settings */
"Settings for notifications that are sent to the email tied to your account." = "Gosodiadau ar gyfer hysbysiadau sy'n cael eu anfon i'r e-bost sy'n gysylltiedig â'ch cyfrif.";

/* Descriptive text for the Push Notifications Settings */
"Settings for push notifications that appear on your mobile device." = "Gosoodiadau hysbysiadau gwthio sy'n ymddangos ar eich dyfais symudol.";

/* Message to show when setting save failed */
"Settings update failed" = "Methodd diweddaru'r gosodiadau";

/* No comment provided by engineer. */
"Seven days worth of log files are kept on file." = "Mae gwerth saith diwrnod o ffeiliau cofnod yn cael eu cadw.";

/* Option to allow the user to shake the device to pull up the feedback mechanism */
"Shake for Feedback" = "Ysgwyd am Adborth";

/* No comment provided by engineer. */
"Share" = "Rhannu";

/* Placeholder for the post body. */
"Share your story here..." = "Rhanwch eich stori yma...";

/* Label for configuration switch to show/hide the header for the related posts section */
"Show Header" = "Dangos Pennyn";

/* Label for configuration switch to show/hide images thumbnail for the related posts */
"Show Images" = "Dangos Delweddau";

/* Label for configuration switch to enable/disable related posts */
"Show Related Posts" = "Dangos Cofnodion sy'n Perthyn";

/* Button title for Sign In Action */
"Sign In" = "Mewngofnodi";

/* No comment provided by engineer. */
"Sign in failed. Please try again." = "Mewngofnodi wedi methu. Ceisiwch eto.";

/* No comment provided by engineer. */
"Sign in to WordPress.com" = "Mewngofnodi i WordPress.com";

/* No comment provided by engineer. */
"Since" = "Ers";

/* NUX First Walkthrough Page 2 Site Address Placeholder */
"Site Address (URL)" = "Cyfeiriad Gwefan (URL)";

/* The title of the reader when previewing posts from a site. */
"Site Details" = "Manylion y Wefan";

/* No comment provided by engineer. */
"Site Title" = "Teitl y Wefan";

/* Setting: indicates if Achievements will be notified */
"Site achievements" = "Llwyddiannau'r wefan";

/* No comment provided by engineer. */
"Site address must be at least 4 characters." = "Rhaid i gyfeiriad gwefan fod o leiaf 4 nod.";

/* Setting: indicates if New Follows will be notified */
"Site follows" = "Dilynnwys y wefan";

/* Section title for sites the user has followed. */
"Sites" = "Gwefannau";

/* Image size option title */
"Size" = "Maint";

/* No comment provided by engineer. */
"Skip" = "Hepgor";

/* Confirms with the user if they manually edit the post HTML all media that failed to upload will be removed from it. */
"Some media uploads failed. Switching to the HTML view of this post will remove failed media.\nSwitch anyway?" = "Mae rhai cyfryngau llwytho wedi methu. Bydd newid i olwg HTML y cofnod yn tynnu'r cyfryngau sydd wedi methu.\nNewid beth bynnag?";

/* Confirms with the user if they save the post all media that failed to upload will be removed from it. */
"Some media uploads failed. This action will remove all failed media from the post.\nSave anyway?" = "Mae llwytho rhai cyfryngau wedi methu. Bydd y weithred hon yn tynnu'r holl cyfryngau oll wedi methu o'r cofnod.\nCadw beth bynnag?";

/* This error message occurs when a user tries to create a username that contains an invalid phrase for WordPress.com. The %@ may include the phrase in question if it was sent down by the API */
"Sorry, but your username contains an invalid phrase%@." = "Ymddiheuriadau, ond mae eich enw defnyddiwr yn cynnwys ymadrodd annilys%@.";

/* No comment provided by engineer. */
"Sorry, can't log in" = "Ymddiheuriadau, methu eich mewngofnodi";

/* No comment provided by engineer. */
"Sorry, site addresses can only contain lowercase letters (a-z) and numbers." = "Gall cyfeiriad gwefan gynnwys dim ond llythrennau bach (a-z) a rhifau.";

/* No comment provided by engineer. */
"Sorry, site addresses may not contain the character &#8220;_&#8221;!" = "Ymddiheuriadau, nid oes modd i enwau defnyddwyr gynnwys y nod &#8220;_&#8221;!";

/* No comment provided by engineer. */
"Sorry, site addresses must have letters too!" = "Ymddiheuriadau, rhaid i enw gwefan gynnwys llythrennau hefyd!";

/* No comment provided by engineer. */
"Sorry, that email address is already being used!" = "Mae'r cyfeiriad e-bost yna eisoes yn cael ei ddefnyddio!";

/* No comment provided by engineer. */
"Sorry, that email address is not allowed!" = "Ymddiheuriadau, nid oes modd caniatáu’r cyfeiriad e-bost yna!";

/* This error message occurs when a user tries to create an account with a weak password. */
"Sorry, that password does not meet our security guidelines. Please choose a password with a mix of uppercase letters, lowercase letters, numbers and symbols." = "Ymddiheuriadau, nid yw'r cyfrinair yn bodloni ein canllawiau diogelwch. Dewiswch gyfrinair gyda chymysgedd o prif lythrennau, llythrennau bach, rhifau a symbolau.";

/* No comment provided by engineer. */
"Sorry, that site already exists!" = "Ymddiheuriadau, mae'r wefan honno'n bodoli eisoes!";

/* No comment provided by engineer. */
"Sorry, that site is reserved!" = "Ymddiheuriadau, mae'r wefan yma ar gadw!";

/* No comment provided by engineer. */
"Sorry, that username already exists!" = "Ymddiheuriadau, mae'r enw defnyddiwr yna'n bodoli eisoes!";

/* No comment provided by engineer. */
"Sorry, that username is unavailable." = "Ymddiheuriadau, mae'r enw defnyddiwr yna'n bodoli eisoes.";

/* No comment provided by engineer. */
"Sorry, usernames can only contain lowercase letters (a-z) and numbers." = "Gall cyfeiriad gwefan gynnwys dim ond llythrennau bach (a-z) a rhifau.";

/* No comment provided by engineer. */
"Sorry, usernames may not contain the character &#8220;_&#8221;!" = "Ymddiheuriadau, nid oes modd i enwau defnyddwyr gynnwys y nod &#8220;_&#8221;!";

/* No comment provided by engineer. */
"Sorry, usernames must have letters (a-z) too!" = "Ymddiheuriadau, rhaid i enwau defnyddwyr fod â llythennau (a-z) hefyd!";

/* No comment provided by engineer. */
"Sorry, we can't log you in." = "Ymddiheuriadau, nid oes modd i ni eich mewngofnodi.";

/* No comment provided by engineer. */
"Sorry, you cannot access this feature. Please check your User Role on this site." = "Ymddiheuriadau, ni allwch gael mynediad i'r nodwedd hon. Gwiriwch eich Rôl Defnydd ar y wefan hon.";

/* No comment provided by engineer. */
"Sorry, you may not use that site address." = "Nid oes modd i chi ddefnyddio'r cyfeiriad gwefan hwn.";

/* A short error message leting the user know the requested stream could not be loaded. */
"Sorry. The stream could not be loaded." = "Ymddiheuriadau. Nid oedd modd llwytho'r llif.";

/* Opens the Github Repository Web */
"Source Code" = "Cod Ffynhonnell";

/* Used for Geo-tagging posts by latitude and longitude. Basic form. */
"South" = "De";

/* No comment provided by engineer. */
"Spam" = "Sbam";

/* Standard post format label */
"Standard" = "Safonol";

/* Button title, encourages users to create their first page on their blog. */
"Start a Page" = "Cychwyn Tudalen";

/* Button title, encourages users to create their first post on their blog. */
"Start a Post" = "Cychwyn Cofnod";

/* No comment provided by engineer. */
"Stats" = "Ystadegau";

/* Stats header for single date */
"Stats for %@" = "Ystadegau ar gyfer %@";

/* Stats header label for date range */
"Stats for %@ - %@" = "Ystadegau ar gyfer %1$@ - %2$@";

/* The status of the post. Should be the same as in core WP. */
"Status" = "Statws";

/* User action to stop upload */
"Stop Upload" = "Stopio llwytho";

/* Accessibility label for strikethrough button on formatting toolbar. */
"Strike Through" = "Taro Drwodd";

/* Setting: WordPress.com Suggestions */
"Suggestions" = "Awgrymiadau";

/* No comment provided by engineer. */
"Support" = "Cefnogaeth";

/* No comment provided by engineer. */
"Switch Site" = "Newid Gwefan";

/* No comment provided by engineer. */
"Tagline" = "Llinell Tag";

/* No comment provided by engineer. */
"Tags" = "Tagiau";

/* Title for stats section for Tags & Categories */
"Tags & Categories" = "Tagiau a Chategorïau";

/* No comment provided by engineer. */
"Tags: %@" = "Tagiau: %@";

/* No comment provided by engineer. */
"Take Photo" = "Cymerwch Lun";

/* Placeholder for the main body text. Should hint at tapping to enter text (not specifying body text). */
"Tap here to begin writing" = "Tapiwch yma i ddechrau ysgrifennu";

/* No comment provided by engineer. */
"Tap to cancel uploading." = "Tapiwch i ddiddymu'r llwytho.";

/* Tooltip for the button that allows the user to edit the current page. */
"Tap to edit page" = "Tapiwch i olygu tudalen";

/* Tooltip for the button that allows the user to edit the current post. */
"Tap to edit post" = "Tapiwch i olygu cofnod";

/* This is the blog picker in the editor */
"Tap to select which blog to post to" = "Tap i ddewis pa blog i gofnodi iddo";

/* Label for the Taxonomy area (categories, keywords, ...) in post settings. */
"Taxonomy" = "Tacsonomi";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error accessing the site, most likely due to an error with the server hosting the WP install, but may be a temporary issue. */
"Temporary Server Error" = "Gwall Gweinydd Dros Dro";

/* No comment provided by engineer. */
"Terms of Service" = "Amodau Gwasanaeth";

/* No comment provided by engineer. */
"Text Color" = "Lliw'r Testun";

/* Popup to aid in creating a Link in the Post Editor. */
"Text to be linked" = "Testun i'w gysylltu";

/* No comment provided by engineer. */
"Thanks" = "Diolch";

/* No comment provided by engineer. */
"That email address has already been used. Please check your inbox for an activation email. If you don't activate you can try again in a few days." = "Mae'r cyfeiriad e-bost hwnnw eisoes wedi cael ei ddefnyddio. Gwiriwch eich blwch derbyn am e-bost cychwyn. Os nad ydych yn cychwyn gallwch roi cynnig arall ymhen ychydig ddyddiau.";

/* No comment provided by engineer. */
"That site address is not allowed." = "Nid yw cyfeiriad y safle yn cael ei ganiatáu.";

/* No comment provided by engineer. */
"That site is currently reserved but may be available in a couple days." = "Mae'r wefan ar gadw ar hyn o bryd ond gall fod ar gael ymhen ychydig o ddyddiau.";

/* No comment provided by engineer. */
"That username is currently reserved but may be available in a couple of days." = "Mae'r enw defnyddiwr yna ar gadw ar hyn o bryd ond gall fod ar gael ymhen ychydig o ddyddiau.";

/* No comment provided by engineer. */
"That username is not allowed." = "Nid yw'r enw defnyddiwr yna'n cael ei ganiatáu.";

/* No comment provided by engineer. */
"The Extra Debug feature includes additional information in activity logs, and can help us troubleshoot issues with the app." = "Mae'r nodwedd Dadfygio Ychwanegol yn cynnwys gwybodaeth ychwanegol yn y cofnodion gweithgaredd sy'n gallu'n cynorthwyo i ddatrys anhawsterau gyda'r ap.";

/* No comment provided by engineer. */
"The Internet connection appears to be offline." = "Mae'n ymddangos bod y cysylltiad Rhyngrwyd all-lein.";

/* Error message describing a problem with a URL. */
"The URL is missing a valid host." = "Nid oes gan URL westai dilys.";

/* Text for related post cell preview */
"The WordPress for Android App Gets a Big Facelift" = "Mae Ap WordPress Android yn Derbyn Adnewyddiad Mawr";

/* No comment provided by engineer. */
"The app can't recognize the server response. Please, check the configuration of your site." = "Nid yw'r ap yn gallu a adnabod ymateb y gweinydd. Gwiriwch ffurfweddiad eich gwefan.";

/* No comment provided by engineer. */
"The certificate for this server is invalid. You might be connecting to a server that is pretending to be “%@” which could put your confidential information at risk.\n\nWould you like to trust the certificate anyway?" = "Mae'r dystysgrif ar gyfer y gweinydd hwn yn annilys. Gall eich bod yn cysylltu â gweinydd sy'n esgus bod yn “%@” sy'n gallu peryglu eich gwybodaeth gyfrinachol.\n\nHoffech chi ymddiried yn y dystysgrif beth bynnag?";

/* No comment provided by engineer. */
"The internet connection appears to be offline." = "Mae'n ymddangos bod y cysylltiad rhyngrwyd all-lein.";

/* WordPress.com Push Authentication Expired message */
"The login request has expired. Log in to WordPress.com to try again." = "Mae'r cais mewngofnodi wedi dod i ben. Mewngofnodwch i WordPress.comi geisio eto.";

/* No comment provided by engineer. */
"The server returned an empty response. This usually means you need to increase the memory limit for your site." = "Mae'r gweinydd wedi anfon ymateb gwag. Mae hyn yn golygu fel arfer fod angen cynyddu'r terfyn cof ar gyfer eich gwefan.";

/* Message expliaining that the specified site will no longer appear in the user's reader.  The '%@' characters are a placeholder for the title of the site. */
"The site %@ will no longer appear in your reader. Tap to undo." = "Ni fydd gwefan %@ bellach y ymddangos yn eich darllennydd. Tapiwch i ddadwneud hyn.";

/* No comment provided by engineer. */
"The site address must be shorter than 64 characters." = "Rhaid i gyfeiriad y wefan fod yn llai na 64 nod.";

/* No comment provided by engineer. */
"The site at %@ uses WordPress %@. We recommend to update to the latest version, or at least %@" = "Mae'r wefan %1$@ yn defnyddio WordPress %2$@. Rydym yn argymell ei diweddaru i'r fersiwn diweddaraf, neu o leiaf %3$@";

/* Message shown when the reader finds no posts for the chosen list */
"The sites in this list have not posted anything recently." = "Nid yw'r gwefannau ar y rhestr wedi cofnodi dim yn ddiweddar.";

/* No comment provided by engineer. */
"The username or password stored in the app may be out of date. Please re-enter your password in the settings and try again." = "Gall fod yr enw defnyddiwr neu gyfrinair sy'n cael ei gadw yn y app yn hen. Rhowch eich cyfrinair eto yn y gosodiadau a cheisio eto.";

/* No comment provided by engineer. */
"Themes" = "Themâu";

/* No comment provided by engineer. */
"There are media items in this post that aren't uploaded to the server. Do you want to continue?" = "Mae yna eitemau cyfrwng yn y cofnod hwn sydd heb eu llwytho i'r gweinydd. Hoffech chi barhau?";

/* Displayed after Notification Settings failed to load */
"There has been a problem while loading your Notification Settings" = "Bu anhawster wrth lwytho eich Gosodiadau Hysbysiadau";

/* No comment provided by engineer. */
"There has been an error while trying to reach your site." = "Bu gwall tra'n ceisio cyrraedd eich gwefan.";

/* Error displayed if a comment fails to get updated */
"There has been an unexpected error while editing your comment" = "Bu gwall annisgwyl tra'n golygu eich sylw";

/* No comment provided by engineer. */
"There has been an unexpected error while sending your reply" = "Bu gwall annisgwyl wrth anfon eich ateb";

/* Displayed after a failed Notification Settings call */
"There has been an unexpected error while updating your Notification Settings" = "Bu gwall annisgwyl tra'n diweddaru eich Gosodiadau Hysbysu";

/* No comment provided by engineer. */
"There has been an unexpected error while updating your comment" = "Bu gwall annisgwyl wrth ddiweddaru eich sylw";

/* Error message informing the user that there was a problem blocking posts from a site from their reader. */
"There was a problem blocking posts from the specified site." = "Bu anhawster wrth rwystro cofnodion o'r wefan honno.";

/* Message for the warning shown to the user when the app realizes there should be an auth token but there isn't one. */
"There was a problem connecting to WordPress.com. Please sign in again." = "Bu anhawster wrth gysylltu â WordPress.com. Mewngofnodwch eto.";

/* No comment provided by engineer. */
"There was a problem connecting to your stats. Would you like to retry?" = "Roedd anhawster cysylltu i'ch ystadegau. Hoffech chi geisio eto?";

/* Generic message explaining there was a problem finding the user's current location. */
"There was a problem finding your current location." = "Bu anhawster canfod eich lleoliad cyfredol.";

/* Short notice that there was a problem following a site and instructions on how to notify us of the problem. */
"There was a problem following the site.  If the problem persists you can contact us via the Me > Help & Support screen." = "Bu anhawster wrth ddilyn gwefan. Os yw'r anhawster yn parhau gallwch gysylltu â ni drwy'r sgrin Fi > Cymorth a Chefnogaeth";

/* Error message informing the user that there was a problem clearing the block on site preventing its posts from displaying in the reader. */
"There was a problem removing the block for specified site." = "Bu anhawster wrth gael gwared ar y bloc ar gyfer gwefan benodol.";

/* Short notice that there was a problem unfollowing a site and instructions on how to notify us of the problem. */
"There was a problem unfollowing the site. If the problem persists you can contact us via the Me > Help & Support screen." = "Bu anhawster wrth ddad-ddilyn gwefan. Os yw'r anhawster yn parhau gallwch gysylltu â ni drwy'r sgrin Fi > Cymorth a Chefnogaeth";

/* Explaining to the user there was an generic error accesing media. */
"There was a problem when trying to access your media. Please try again later." = "Bu anhawster wrth geisio cael mynediad i'ch cyfrwng. Ceisiwch eto.";

/* No comment provided by engineer. */
"There was a server error communicating with your site:\n%@\nTap 'Need Help?' to view the FAQ." = "Bu gwall gweinydd wrth gyfathrebu gyda'ch gwefan: \n%@\nTapiwch 'Angen Cymorth?' i weld y Cwestiynau Cyffredin.";

/* No comment provided by engineer. */
"There was an error loading the page." = "Bu gwall wrth lwytho'r dudalen.";

/* No comment provided by engineer. */
"There was an error sending your feedback, please try again." = "Digwyddodd gwall wrth anfon eich adborth, rhowch gynnig arni eto.";

/* No comment provided by engineer. */
"This Photo Stream image cannot be added to your WordPress. Try saving it to your Camera Roll before uploading." = "Nid oes modd ychwanegu'r ddelwedd Photo Stream i'ch WordPress. Ceisiwch ei chadw i'ch Camera Roll cyn llwytho.";

/* No comment provided by engineer. */
"This Photo Stream video cannot be added to your WordPress. Try saving it to your Camera Roll before uploading." = "Nid oes modd ychwanegu' fideo Photo Stream hwn i'ch WordPress. Ceisiwch ei gadwi'ch Camera Roll cyn llwytho.";

/* No comment provided by engineer. */
"This app needs permission to access the Camera to capture new media, please change the privacy settings if you wish to allow this." = "Mae'r ap angen caniatâd i gael mynediad at y Camera i gipio cyfryngau newydd, newidiwch y gosodiadau preifatrwydd os ydych yn dymuno caniatáu hyn.";

/* Explaining to the user why the app needs access to the device media library. */
"This app needs permission to access your device media library in order to add photos and\/or video to your posts. Please change the privacy settings if you wish to allow this." = "Mae'r ap angen caniatâd i gael mynediad i lyfrgell cyfryngau eich dyfais er mwyn ychwanegu lluniau a\/neu fideo i'ch cofnodion. Newidiwch y gosodiadau preifatrwydd os ydych yn dymuno caniatáu hyn.";

/* Message of the alert that lets the users know there are unsaved changes in a post they're opening. */
"This post has local changes that were not saved. You can now save them or discard them." = "Mae gan y cofnod newidiadau lleol sydd heb eu cadw. Nawr gallwch eu cadw neu eu gwaredu.";

/* Message shown when the reader finds no posts for the chosen site */
"This site has not posted anything yet. Try back later." = "Nid yw'r wefan wedi cofnodi dim eto. Dewch nôl cyn bo hir.";

/* No comment provided by engineer. */
"This site is not connected to that WordPress.com username" = "Nid yw'r wefan wedi ei gysylltu â'r enw defnyddiwr WordPress.com hwnnw";

/* This is displayed if the user taps the uploading text in the post editor */
"This will stop the current media uploads in progress. Are you sure you want to proceed?" = "Bydd hyn yn atal llwytho'r cyfryngau presennol. Ydych chi'n siŵr eich bod am barhau?";

/* Thumbnail image size. Should be the same as in core WP. */
"Thumbnail" = "Llun bach";

/* WordPress.com Marketing Footer Text */
"Tips for getting the most out of WordPress.com." = "Awgrymiadau ar gyfer sut mae cael y gorau o WordPress.com.";

/* No comment provided by engineer. */
"Title" = "Teitl";

/* Error popup message to indicate that there was no category title filled in. */
"Title for a category is mandatory." = "Mae teitl gyfer y categori yn orfodol.";

/* NSPhotoLibraryUsageDescription: Sentence to justify why the app asks permission from the user to access is Media Library. */
"To add photos or videos to your posts." = "I ychwanegu lluniau neu fideos i'ch cofnodion.";

/* Displayed when Push Notifications are disabled (iOS 7) */
"To enable notifications:\n\n1. Open **iOS Settings**\n2. Tap **Notifications**\n3. Select **WordPress**\n4. Turn on **Allow Notifications**" = "I alluogi hysbysiadau:\n\n1. Agor **iOS Settings**\n2. Tapio **Notifications**\n3. Dewis **WordPress**\n4. Cychwyn **Allow Notifications**";

/* NSCameraUsageDescription: Sentence to justify why the app is asking permission from the user to use is camera. */
"To take photos or videos to use in your posts." = "I gymryd lluniau neu fideos i'w defnyddio yn eich cofnodion";

/* Notifications Today Section Header */
"Today" = "Heddiw";

/* Insights today section header */
"Today's Stats" = "Ystadegau Heddiw";

/* No comment provided by engineer. */
"Topic" = "Pwnc";

/* No comment provided by engineer. */
"Total" = "Cyfanswm";

/* Label of Total count of email followers with value */
"Total Email Followers: %@" = "Cyfanswm Dilynwyr E-bost: %@";

/* Label of Total count of WordPress.com followers with value */
"Total WordPress.com Followers: %@" = "Cyfanswm Dilynwyr WordPress.com: %@";

/* No comment provided by engineer. */
"Trash" = "Dileu";

/* No comment provided by engineer. */
"Trashed" = "Wedi eu rhoi yn y sbwriel";

/* Theme sort, trending themes */
"Trending" = "Trendio";

/* Connect when the SSL certificate is invalid */
"Trust" = "Ymddiried";

/* No comment provided by engineer. */
"Try Again" = "Ceisiwch Eto";

/* Launches the Twitter App */
"Twitter" = "Twitter";

/* No comment provided by engineer. */
"URL" = "URL";

/* No comment provided by engineer. */
"Unable to Connect" = "Methu Cysylltu";

/* Title of a prompt saying the app needs an internet connection before it can load posts */
"Unable to Load Posts" = "Methu Llwytho Cofnodion";

/* Title of error prompt shown when a sync the user initiated fails. */
"Unable to Sync" = "Methu Cydweddu";

/* No comment provided by engineer. */
"Unable to find a WordPress site at that URL. Tap 'Need Help?' to view the FAQ." = "Methu canfod gwefan WordPress ar y URL yma. Tapiwch 'Angen Cymorth?'i weld y Cwestiynau Cyffredin.";

/* Error message that is displayed when the user's current location could not be found after a few seconds. */
"Unable to find the current location in a reasonable amount of time." = "Methu dod o hyd i'r lleoliad presennol o fewn cyfnod rhesymol.";

/* Title of dialog notifing user they cannot insert an image in the editor's HTML mode. */
"Unable to insert image" = "Methu mewnosod delwedd";

/* Prompts the user they need to update their jetpack credentals after an error. */
"Unable to sign in to Jetpack. Please update your credentials and try again." = "Methu mewngofnodi i Jetpack. Diweddarwch eich manylion a cheisio eto.";

/* Accessibility label for underline button on formatting toolbar. */
"Underline" = "Tanlinellu";

/* No comment provided by engineer. */
"Undo" = "Dadwneud";

/* No comment provided by engineer. */
"Unfollow" = "Peidio Dilyn";

/* Verb. An option to unfollow a site. */
"Unfollow Site" = "Dad-ddilyn gwefan";

/* Short confirmation that unfollowing a site was successful */
"Unfollowed site" = "Gwefan wedi ei dad-ddilyn";

/* No comment provided by engineer. */
"Unknown" = "Anhysbys";

/* No comment provided by engineer. */
"Unknown Search Terms" = "Termau Chwilio Anhysbys";

/* No comment provided by engineer. */
"Unknown error" = "Gwall anhysbys";

/* Accessibility label for unordered list button on formatting toolbar. */
"Unordered List" = "Rhestr Didrefn";

/* Filters Unread Notifications */
"Unread" = "Heb ei ddarllen";

/* Title of the alert that lets the users know there are unsaved changes in a post they're opening. */
"Unsaved changes." = "Newidiadau heb eu cadw.";

/* Update button label (saving content, ex: Post, Page, Comment). */
"Update" = "Diweddaru";

/* Button shown if there are unsaved changes and the author is trying to move away from an already published/saved post. */
"Update Draft" = "Diweddaru Drafft";

/* No comment provided by engineer. */
"Update Jetpack" = "Diweddariad Jetpack";

/* Text for related post cell preview */
"Upgrade Focus: VideoPress For Weddings" = "Pwyslais Diweddaru: VideoPress ar gyfer Priodasau";

/* No comment provided by engineer. */
"Uploaded" = "Wedi ei lwytho";

/* No comment provided by engineer. */
"Uploading" = "Llwytho i fyny";

/* Title for alert when trying to save/exit a post before media upload process is complete. */
"Uploading media" = "Llwytho cyfryngau";

/* No comment provided by engineer. */
"Uploading..." = "Llwytho...";

/* No comment provided by engineer. */
"Uploads failed" = "Llwytho wedi methu";

/* No comment provided by engineer. */
"Use Latest Photo" = "Defnyddiwch y Llun Diweddaraf";

/* No comment provided by engineer. */
"Use this site" = "Defnyddiwch y wefan hon";

/* Label for entering username in the username field */
"Username" = "Enw defnyddiwr";

/* NUX First Walkthrough Page 2 Username Placeholder */
"Username \/ Email" = "Enw defnyddiwr \/ E-bost";

/* Setting: indicates if Mentions will be notified */
"Username mentions" = "Cyfeirio yn ôl enw defnyddiwr";

/* No comment provided by engineer. */
"Username must be at least 4 characters." = "Rhaid i enw defnyddiwr fod o leiaf yn 4 nod o hyd.";

/* No comment provided by engineer. */
"Username must be less than fifty characters." = "Rhaid i enw defnyddiwr fod yn llai na hanner cant o nodau.";

/* No comment provided by engineer. */
"Verification Code" = "Cod Dilysu";

/* Button title for Two Factor code verification */
"Verify" = "Dilysu";

/* Push Authentication Alert Title */
"Verify Sign In" = "Dilysu mewngofnodi";

/* Displays the version of the App */
"Version" = "Fersiwn";

/* No comment provided by engineer. */
"Video" = "Fideo";

/* The title for an alert that says the video the user selected isn't available. */
"Video unavailable" = "Nid yw'r fideo ar gael";

/* Title for stats section for Videos */
"Videos" = "Fideos";

/* No comment provided by engineer. */
"View" = "Golwg";

/* View All button in stats for larger list */
"View All" = "Gweld y Cyfan";

/* No comment provided by engineer. */
"View Site" = "Gweld y Wefan";

/* View Web Version button in stats */
"View Web Version" = "Gweld y Fersiwn Gwe";

/* Displays More Rows */
"View all…" = "Gweld y cyfan...";

/* Displays Less Rows */
"View less…" = "Gweld llai...";

/* No comment provided by engineer. */
"Views" = "Golwg";

/* The visibility settings of the post. Should be the same as in core WP. */
"Visibility" = "Gwelededd";

/* A call to action to visit the specified blog.  The '%@' characters are a placholder for the blog name. */
"Visit %@" = "Ewch i %@";

/* A call to action to visit the specified blog.  The '%@' characters are a placholder for the blog name. */
"Visit %@ for more" = "Ewch i %@ am ragor";

/* An option to visit the site to which a specific post belongs */
"Visit Site" = "Ymweld â'r Wefan";

/* No comment provided by engineer. */
"Visit the Help Center to get answers to common questions, or visit the Forums to ask new ones." = "Ewch i'r Ganolfan Gymorth i gael atebion i gwestiynau cyffredin, neu ewch i'r Fforymau i ofyn rhai newydd.";

/* No comment provided by engineer. */
"Visitors" = "Ymwelwyr";

/* Accessibility label for visitors and views graph view */
"Visitors and Views Graph" = "Graff Ymwelwyr a Barn";

/* Option to enable the visual editor */
"Visual Editor" = "Golygydd Gweledol";

/* No comment provided by engineer. */
"WP Admin" = "Gweinyddu WP";

/* Message displayed in stats while waiting for remote operations to finish. */
"Waiting for data..." = "Aros am ddata...";

/* No comment provided by engineer. */
"We can't access your photos, please ensure this application has access in Settings." = "Nid ydych yn gallu cael mynediad i'ch lluniau, gwnewch yn siŵr fod gan y rhaglen synediad i'r Gosodiadau.";

/* No comment provided by engineer. */
"We couldn't upload the photo, please try again." = "Doedd dim modd llwytho'r llun, rhowch gynnig arall eto.";

/* No comment provided by engineer. */
"We have received your feedback and will be in contact soon." = "Rydym wedi derbyn eich adborth a byddwn mewn cysylltiad yn fuan.";

/* The title of the option group for editing an image's size, alignment, etc. on the image details screen. */
"Web Display Settings" = "Gosodiadau'r Dangosydd Gwe";

/* Title of Weeks segmented control */
"Weeks" = "Wythnos";

/* A message title */
"Welcome to the reader" = "Croeso i'r darllenydd";

/* Used for Geo-tagging posts by latitude and longitude. Basic form. */
"West" = "Gorllewin";

/* Title displayed in the Notification Settings for WordPress.com */
"We’ll always send important emails regarding your account, but you can get some helpful extras, too." = "Byddwn bob amser yn anfon e-byst ynghylch eich cyfrif, ond mae modd i chi gael rhai ychwanegion defnyddiol, hefyd.";

/* This is the string we display when prompting the user to review the app */
"What do you think about WordPress?" = "Beth ydych chi'n ei feddwl o WordPress?";

/* Settings for a Wordpress Blog */
"WordPress Blog" = "Blog WordPress";

/* No comment provided by engineer. */
"WordPress Forums" = "Fforymau WordPress";

/* No comment provided by engineer. */
"WordPress Help Center" = "Canolfan Cymorth WordPress";

/* No comment provided by engineer. */
"WordPress version too old" = "Mae'r fersiwn yma o WordPress yn rhy hen";

/* No comment provided by engineer. */
"WordPress would like to add your location to posts on sites where you have enabled geotagging." = "Hoffai WordPress ychwanegu eich lleoliad i gofnodion ar wefannau lle rydych wedi galluogi geotagio.";

/* WordPress.com segmented control for stats */
"WordPress.com" = "WordPress.com";

/* WordPress.com sign-in/sign-out section header title */
"WordPress.com Account" = "Cyfrif WordPress.com";

/* WordPress.com Notification Settings Title */
"WordPress.com Updates" = "Diweddariadau WordPress.com";

/* No comment provided by engineer. */
"WordPress.com password" = "Cyfrinair WordPress.com";

/* No comment provided by engineer. */
"WordPress.com username" = "Enw defnyddiwr WordPress.com";

/* No comment provided by engineer. */
"Would you like to create one?" = "Hoffech chi greu un?";

/* Displayed when the user views published pages in the pages list and there are no pages */
"Would you like to publish your first page?" = "Hoffech chi greu eich tudalen gyntaf?";

/* Displayed when the user views published posts in the posts list and there are no posts */
"Would you like to publish your first post?" = "Hoffech chi greu eich cofnod cyntaf?";

/* No comment provided by engineer. */
"Would you like to schedule a draft to publish?" = "Hoffech chi amserlenni drafft i'w gyhoeddi?";

/* Placeholder text for inline compose view */
"Write a reply…" = "Ysgrifennu ateb…";

/* Title for the writing section in site settings screen */
"Writing" = "Ysgrifennu";

/* Title of Years segmented control */
"Years" = "Blwyddyn";

/* Yes */
"Yes" = "Iawn";

/* Notifications Yesterday Section Header */
"Yesterday" = "Ddoe";

/* Error message informing the user that they are already following a site in their reader. */
"You are already following that site." = "Rydych eisoes yn dilyn y wefan honno.";

/* This is a notification the user receives if they are trying to save a post (or exit) before the media upload process is complete. */
"You are currently uploading media. Please wait until this completes." = "Rydych yn lwytho cyfryngau ar hyn o bryd. Arhoswch nes i hyn orffen.";

/* This prompt is displayed when the user attempts to stop media uploads in the post editor. */
"You are currently uploading media. This action will cancel uploads in progress.\n\nAre you sure?" = "Rydych yn llwytho cyfryngau ar hyn o bryd. Bydd y weithredu hon yn diddymu unrhyw lwytho cyfredol arall.\n\nYdych chi siŵr?";

/* A suggestion to the user that they try following a site in their reader. */
"You are not following any sites yet. Why not follow one now?" = "Nid ydych yn dilyn unrhyw wefan eto. Beth am ddilyn un awr?";

/* Action sheet title for setting Today Widget site to the current one */
"You can display a single site's stats in the iOS Today\/Notification Center view." = "Gallwch ddangos ystaegau gwefan unigol yng ngolwg iOS Today\/Notification Center.";

/* Body of dialog notifing user they cannot insert an image in the editor's HTML mode. */
"You cannot insert images while editing HTML directly. Please switch back to visual mode." = "Nid oes modd ychwanegu delweddau tra'n golygu HTML yn uniongyrchol. Newidiwch yn ôl i'r dull gweledol.";

/* No comment provided by engineer. */
"You cannot use that email address to signup. We are having problems with them blocking some of our email. Please use another email provider." = "Nid oes modd i chi ddefnyddio'r cyfeiriad e-bost yna i ymuno. Mae gennym anhawster ohonynt yn rhwystro rhai o'n e-byst. Defnyddiwch e-bost arall.";

/* No comment provided by engineer. */
"You don't have any drafts." = "Nid oes gennych unrhyw ddrafftiau.";

/* Displayed when the user views trashed in the pages list and there are no pages */
"You don't have any pages in your trash folder." = "Nid oes gennych dudalennau yn eich ffolder sbwriel.";

/* Displayed when the user views trashed in the posts list and there are no posts */
"You don't have any posts in your trash folder." = "Nid oes gennych gofnodion yn eich ffolder sbwriel.";

/* Displayed when the user views scheduled pages in the pages list and there are no pages */
"You don't have any scheduled pages." = "Nid oes gennych dudalennau wedi eu hamserlenni.";

/* Displayed when the user views scheduled posts in the posts list and there are no posts */
"You don't have any scheduled posts." = "Nid oes gennych gofnodion wedi eu hamserlenni.";

/* Placeholder text when no latest post summary exists */
"You have not published any posts yet." = "Nid ydych wedi cyhoeddi unrhyw gofnodion eto.";

/* Title of message with options that shown when there are unsaved changes and the author is trying to move away from the post. */
"You have unsaved changes." = "Mae gennych newidiadau heb eu cadw.";

/* Displayed when the user views published pages in the pages list and there are no pages */
"You haven't published any pages yet." = "Nid ydych wedi cyhoeddi unrhyw dudalennau eto.";

/* Displayed when the user views published posts in the posts list and there are no posts */
"You haven't published any posts yet." = "Nid ydych wedi cyhoeddi unrhyw gofnodion eto.";

/* Error message informing the user that being logged into a WordPress.com account is required. */
"You must be signed in to a WordPress.com account to perform this action." = "Rhaid eich bod wedi eich mewngofnodi i gyfrif WordPress.com i wneud hyn.";

/* The label we display in the feedback view that is brought up when the user doesn't like our app and they've indicated they want to give feedback */
"Your Email:" = "Eich Cyfeiriad E-bost:";

/* Displayed in the Notification Settings View */
"Your Sites" = "Eisch Gwefannau";

/* No comment provided by engineer. */
"Your device is not configured to send e-mail." = "Nid yw eich dyfais wedi ei ffurfweddu i anfon e-bost.";

/* Message for prompt when user tries to close feedback view after having entered text */
"Your message will be lost." = "Bydd eich neges yn cael ei golli.";

/* Hint for users when private privacy setting is set */
"Your site is only visible to you and users you approve." = "Mae eich gwefan yn weladwy i chi yn unig a defnyddwyr rydych wedi eu cymeradwyo.";

/* Hint for users when public privacy setting is set */
"Your site is visible to everyone, and it may be indexed by search engines." = "Mae'r wefan yn weladwy i bawb, ac o bosib wedi ei fynegeio gan beiriannau chwilio.";

/* Hint for users when hidden privacy setting is set */
"Your site is visible to everyone, but asks to search engines to not index your site." = "Mae eich gwefan yn weladwy i bawb, ond mae'n gofyn i beiriannau chwilio i beidio mynegeio eich gwefan.";

/* Error message shown in the set up process if the WP install was unable to be added to the app due to an error being returned from the site. */
"Your site returned a %d error.\nThis is usually due to an incompatible server configuration.\nPlease contact your hosting provider, or reach out to us using our in-app support." = "Mae eich gwefan wedi dychwelyd gwall %d.\nMae hyn fel arfer yn sgil ffurfweddu'r gweinyddwr yn anghywir.\nCysylltwch â'ch darparwr gwesteio neu cysylltwch â ni drwy'r cymorth o fewn yr ap.";

/* Age between dates equaling one day. */
"a day" = "diwrnod";

/* Age between dates equaling one month. */
"a month" = "mis";

/* Age between dates equaling one year. */
"a year" = "blwyddyn";

/* Age between dates equaling one hour. */
"an hour" = "awr";

/* This is text we display in the feedback view that we display when we prompt the user for an app review and they've indicated they don't like it and want to give us feedback. Tapping on this 'button' will pull up the photo browser so they can attach a photo */
"attach a file" = "atodi ffeil";

/* Bold text formatting in the Post Editor. This string will be used in the Undo message if the last change was adding formatting. */
"bold" = "trwm";

/* <del> (deleted text) HTML formatting in the Post Editor. This string will be used in the Undo message if the last change was adding a <del> HTML element. */
"del" = "dil";

/* No comment provided by engineer. */
"delete" = "dileu";

/* (placeholder) Help the user enter a URL into the field */
"http:\/\/my-site-address (URL)" = "http:\/\/cyfeiriad-fy-ngwefan (URL)";

/* Placeholder text for the link field. */
"http:\/\/www.example.com\/" = "http:\/\/www.esiampl.com\/";

/* Text for related post cell preview */
"in \"Apps\"" = "yn \"Apiau\"";

/* Text for related post cell preview */
"in \"Mobile\"" = "yn \"Symudol\"";

/* Text for related post cell preview */
"in \"Upgrade\"" = "yn \"\"Diweddaru\"";

/* Italic text formatting in the Post Editor. This string will be used in the Undo message if the last change was adding formatting. */
"italic" = "italig";

/* Later today */
"later today" = "yn hwyrach heddiw";

/* Link helper button in the Post Editor. This string will be used in the Undo message if the last change was adding a link. */
"link" = "dolen";

/* Adding a More excerpt cut-off in the Post Editor. This string will be used in the Undo message if the last change was adding this formatting. */
"more" = "rhagor";

/* Blockquote HTML formatting in the Post Editor. This string will be used in the Undo message if the last change was adding a blockquote. */
"quote" = "dyfyniad";

/* Sends an SMS with the Multifactor Auth Code */
"send the code via text message." = "anfonwch y cod drwy neges testun.";

/* Today */
"today" = "heddiw";

/* Underline text formatting in the Post Editor. This string will be used in the Undo message if the last change was adding formatting. */
"underline" = "tanlinellu";

/* The details for the \"What's New\" dialog */
"whats-new-inapp-details" = "Mae'r ap WordPress ar gyfer iOS bellach yn cynnwys golygydd gweledol newydd hardd. Rhowch gynnig arni drwy greu cofnod newydd.";

/* The title for the \"What's New\" dialog */
"whats-new-inapp-title" = "Golygydd newydd sbon";

/* Part of a label letting the user know how any words are in a post. For example: '300 words' */
"words" = "gair";

/* About View's Footer Text */
"© (year) Automattic, Inc." = "© (year) Automattic, Inc.";

